{
    "adjective": [
        "вірний",
        "дикий",
        "злий",
        "люблячий",
        "чутливий",
        "хитрий"
    ],
    "health": [
        "Абсолютно здоровий",
        "Альцгеймер",
        "артрит",
        "астма",
        "ботулізм",
        "віспа",
        "геморой",
        "гонорея",
        "грип",
        "діабет",
        "зайча губа",
        "лейкоз",
        "лейкоз",
        "маразм",
        "наркоман",
        "наркоман",
        "отит",
        "остеохондроз",
        "педикульоз",
        "правець",
        "променева хвороба",
        "простатит/молочниця",
        "псоріаз",
        "рак легень",
        "радикуліт",
        "Ржавий ніж в плечі",
        "сифіліс",
        "cпід",
        "тиф",
        "тремор",
        "nуберкульоз",
        "цинга"
    ],
    "hobby": [
        "баскетбол",
        "грати в комп'ютерні ігри",
        "грати в настільні ігри",
        "малювати",
        "стрільба",
        "танцювати",
        "теніс",
        "читати",
        "футбол"
    ],
    "phobia": [
        "Без фобій",
        "аблютофобія",
        "агірофобія",
        "аквафобія",
        "акрофобія",
        "айлурофобія",
        "алгофобія",
        "акустикофобія",
        "арахнофобія",
        "астрафобія",
        "вермінофобія",
        "генофобія",
        "гімнофобія",
        "кінофобія",
        "мегалофобія",
        "мусофобія",
        "некрофобія",
        "росіянофобія",
        "сомніфобія",
        "спектрофобія"
    ],
    "job": [
        "HR",
        "3D дизайнер",
        "актор",
        "архітектор",
        "барбер",
        "безробітний",
        "бібліотекар",
        "бізнесмен",
        "будівельник",
        "веб-дизайнер",
        "викладач",
        "вихователь",
        "волейболіст",
        "гандболіст",
        "грабіжник",
        "гід",
        "гінеколог",
        "дворник",
        "дегустатор кормів",
        "дилер",
        "доглядач за пандами",
        "доглядач у зоопарку",
        "домогосподар",
        "дояр",
        "дублер",
        "захисник пасажирів",
        "збирач м'ячів",
        "зоолог",
        "інженер",
        "інфлюенсер",
        "історик",
        "кіберспортсмен",
        "комік",
        "контрабандист",
        "копач могил",
        "кухар",
        "лего-скульптор",
        "людина, що працює в банкоматі",
        "людина-лякало",
        "майстер манікюру",
        "макулатурщик",
        "маляр",
        "мер",
        "модельєр",
        "музикант",
        "нюхач запахів",
        "нюхач яєць",
        "охоронець",
        "письменник",
        "поліцейський",
        "президент",
        "програміст",
        "продавець на ринку",
        "проджект менеджер",
        "професійний обіймач",
        "професійний сонця",
        "режисер",
        "рієлтор",
        "рятівник пінгвінів",
        "садівник",
        "сантехнік",
        "системний адміністратор",
        "сценарист",
        "стрімер",
        "стрінгер",
        "староста села",
        "стендапер",
        "столяр",
        "таролог",
        "телеведучий",
        "технолог",
        "тестувальник",
        "тренер",
        "трубадур",
        "туалетний гід",
        "фахівець з мозку",
        "фрілансер",
        "хірург",
        "хобіхорсінґер",
        "художник",
        "черговик",
        "чистильник килимів",
        "чорнобильський сталкер",
        "шахтар",
        "інфоциган"
    ],
    "fact": [
        "був стендапером",
        "грає в Brawl Stars",
        "гучно сміється",
        "дивиться аніме",
        "завжди пердить вонючим",
        "канібал",
        "мав громадянство рф",
        "мав судимість",
        "сходив на всі гори України"
    ],
    "backpack": [
        "аптечка",
        "акволанг",
        "автомат",
        "блок пива",
        "блок туалетного паперу",
        "від голови ліки",
        "граната",
        "дитина",
        "дерев'яний кінь",
        "дріжжі",
        "дефебрилятор",
        "книги Террі Пратчетта",
        "коргі",
        "набір теплого одягу",
        "набір для вишивання",
        "ніж",
        "ноутбук",
        "олівці",
        "парилка",
        "пляшки",
        "посібник по виживанню",
        "посібник по садівництву",
        "посібник по програмуванню",
        "презервативи",
        "протеїн",
        "сушена їжа",
        "туристична каструля",
        "топор",
        "шприц",
        "меч"
    ],
    "specialCard": [
        {
            "id": 1,
            "text": "Замінити собі здоров'я на випадкове"
        },
        {
            "id": 2,
            "text": "Замінити собі професію на випадкову"
        },
        {
            "id": 3,
            "text": "Замінити собі рюкзак на випадковий"
        },
        {
            "id": 4,
            "text": "Замінити всім професію на випадкову"
        },
        {
            "id": 5,
            "text": "Замінити всім здоров'я на випадкове"
        },
        {
            "id": 6,
            "text": "Вилікувати собі будь яку хворобу"
        },
        {
            "id": 7,
            "text": "Замінити всім фобію на випадкову"
        },
        {
            "id": 8,
            "text": "Замінити катастрофу на випадкову"
        }
    ],

    "catastrophe": [
        {
            "name": "Глобальне потепління",
            "description": "Збільшення середньої температури Землі викликає танення полярних льодовиків, підвищення рівня світового океану та екстремальні погодні явища. Ці зміни призводять до знищення місць проживання, зменшення біорізноманіття, і зростання конфліктів за ресурси серед людських популяцій."
        },
        {
            "name": "Глобальне похолодання",
            "description": "Різке зниження середньої температури на Землі спричиняє розширення полярних криг і постійне зимове покривало на більших територіях планети. Сільськогосподарські угіддя замерзають, викликаючи дефіцит продовольства. Живі організми, непристосовані до холоду, гинуть, що призводить до масового вимирання видів."
        },
        {
            "name": "Тремтіння землі",
            "description": "По землі на всіх куточках планети ходять величезні титани, зріст котрих коливається від 50 до 60 метрів, а їхнє тіло виділяє гарячу пару.  Їхньою метою є винищення всього людства, але вам вдалося знайти прихисток. З людьми також страждають тварини, рослини, риби та інші представники флори та фауни. Вашою метою є відновлення людства."
        },
        {
            "name": "Пандемія невідомого вірусу",
            "description": "Розповсюдження невідомого раніше смертельного вірусу призводить до глобальної пандемії. Медичні системи перевантажені, економіка паралізована, а соціальний порядок руйнується. Людство бореться за знаходження вакцини та способи виживання у нових умовах."
        },
        {
            "name": "Сонячний сплеск",
            "description": "Величезний сплеск сонячної активності випускає потужний потік заряджених частинок, що вражає Землю, викликаючи масові збої в електромережах, сателітній комунікації та навігаційних системах. Цивілізація зіткнулася з викликом відновлення технологічної інфраструктури."
        },
        {
            "name": "Виверження супервулкану",
            "description": "Виверження супервулкану викидає в атмосферу мільярди тонн попелу та аерозолів, що призводить до глобального похолодання та зниження кількості сонячного світла, що досягає Землі. Аграрний криза та дефіцит продовольства стають неминучими."
        },
        {
            "name": "Біотехнологічна катастрофа",
            "description": "Несанкціоноване або неконтрольоване використання біотехнологій призводить до створення небезпечних організмів, які швидко розповсюджуються та змінюють екосистеми, витісняючи природні види, спричиняючи екологічні катастрофи."
        },
        {
            "name": "Економічний колапс",
            "description": "Глобальна економічна криза, спричинена злиттям величезних боргів, втратою довіри до фінансових інститутів і масовою безробіттям, призводить до соціальних заворушень, зростання злочинності та руйнування основ цивілізації. На фоні кризи, згодом було застосовано ядерну зброю країнами агресорами що спричинило знищення 50% населення."
        },
        {
            "name": "Кібервійна",
            "description": "Розвиток цифрових технологій доходить до точки, де кібератаки стають здатними паралізувати національні оборонні системи, критичну інфраструктуру та фінансові ринки, викликаючи хаос і анархію в глобальному масштабі."
        },
        {
            "name": "Астероїдний удар",
            "description": "Величезний астероїд зіткнувся з Землею, викликавши глобальні пожежі, цунамі та ядерну зиму, що значно знизило сонячне світло, яке досягає поверхні планети. Виживання цивілізації залежить від вміння адаптуватися до радикально змінених умов існування."
        }
    ],
    "shelter": [
        {
            "id": 1,
            "name": "Космічний корабель",
            "description": "Орбітальний модуль, призначений для тривалого проживання у космічному просторі. Обладнаний системами життєзабезпечення, включаючи рециркуляцію повітря, очищення води та вирощування продуктів харчування. Розмір корабля: 2000 кв.м. Час перебування: до 5 років. Кількість їжі: обчислюється відповідно до можливості вирощування. У кораблі є: науково-дослідна лабораторія, житлові модулі, система штучної гравітації."
        },
        {
            "id": 2,
            "name": "Станції метро",
            "description": "Переобладнані для довгострокового проживання підземні станції. Забезпечені системами фільтрації повітря та автономним електроживленням. Розмір укриття: 800 кв.м на станцію. Час перебування: до 6 місяців. Кількість їжі: на 4 місяці. У станціях метро є: спільні спальні зони, запаси медичних препаратів, невелика книгозбірня."
        },
        {
            "id": 3,
            "name": "Підводна станція",
            "description": "Побудована на дні океану станція, обладнана для дослідження морського дна та довгострокового перебування людей. Розмір станції: 500 кв.м. Час перебування: до 1 року. Кількість їжі: на 6 місяців. У станції є: лабораторії, спальні капсули, система переробки води."
        },
        {
            "id": 4,
            "name": "Бункер під землею",
            "description": "Секретний укриття, розташований на глибині 30 метрів під землею. Забезпечений всім необхідним для тривалого проживання. Розмір бункера: 300 кв.м. Час перебування: до 2 років. Кількість їжі: на 1 рік. У бункері є: автономна система життєзабезпечення, медичний пункт, складські приміщення."
        },
        {
            "id": 5,
            "name": "Арктична база",
            "description": "Розташована в серці Арктики база, призначена для вивчення полярних регіонів та виживання в екстремальних умовах. Розмір бази: 600 кв.м. Час перебування: до 3 років. Кількість їжі: на 2 роки. У базі є: науково-дослідні лабораторії, теплиці для вирощування овочів, система відновлення тепла."
        },
        {
            "id": 6,
            "name": "Пустельний анклав",
            "description": "Укриття, створене для адаптації та виживання в умовах пустелі. Обладнане системами збору та очищення води. Розмір анклаву: 250 кв.м. Час перебування: до 1,5 років. Кількість їжі: на 9 місяців. У анклаві є: сонячні панелі, охолоджувальні системи, складські приміщення для води та їжі."
        },
        {
            "id": 7,
            "name": "Самотужки побудоване укриття",
            "description": "Був збудований коли почалася ця катастрофа, знаходиться на болоті далеко за містом недалеко від лісу, у всіх, хто вижив індивідуальні кімнати. Розмір бункера: 180 кв.м. Час перебування: 1 рік 9 місяців. Кількість їжі: на 3 місяці. У бункері є: бойлер, двоспальне ліжко, невеликий спортзал."
        }
    ]
}